CSI API ETABS v1

# cSapModelDesignShearWall Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cDesignShearWall DesignShearWall { get; }

    ReadOnly Property DesignShearWall As cDesignShearWall
    	Get

    Dim instance As cSapModel
    Dim value As cDesignShearWall

    value = instance.DesignShearWall

    property cDesignShearWall^ DesignShearWall {
    	cDesignShearWall^ get ();
    }

    abstract DesignShearWall : cDesignShearWall with get

#### Property Value

Type: cDesignShearWall

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com